log/4k/4k.out
seqwrites4k: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=64
seqread4k: (g=1): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=64
randwrite4k: (g=2): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=64
randread4k: (g=3): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=64
randrw4k: (g=4): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=64
fio-2.1.11
Starting 5 threads
seqwrites4k: Laying out IO file(s) (1 file(s) / 2048MB)
seqread4k: Laying out IO file(s) (1 file(s) / 2048MB)
randwrite4k: Laying out IO file(s) (1 file(s) / 2048MB)
randread4k: Laying out IO file(s) (1 file(s) / 2048MB)
randrw4k: Laying out IO file(s) (1 file(s) / 2048MB)

seqwrites4k: (groupid=0, jobs=1): err= 0: pid=9340: Tue May 16 11:22:13 2017
  write: io=2048.0MB, bw=25754KB/s, iops=6438, runt= 81429msec
    slat (usec): min=2, max=26108, avg= 8.30, stdev=89.28
    clat (msec): min=1, max=188, avg= 9.93, stdev=10.26
     lat (msec): min=1, max=188, avg= 9.94, stdev=10.26
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    4], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    6], 50.00th=[    7], 60.00th=[    9],
     | 70.00th=[   11], 80.00th=[   13], 90.00th=[   20], 95.00th=[   31],
     | 99.00th=[   52], 99.50th=[   64], 99.90th=[  100], 99.95th=[  116],
     | 99.99th=[  149]
    bw (KB  /s): min=13852, max=36264, per=100.00%, avg=25793.67, stdev=4994.34
    lat (msec) : 2=0.06%, 4=18.79%, 10=49.83%, 20=22.32%, 50=7.90%
    lat (msec) : 100=1.00%, 250=0.10%
  cpu          : usr=1.61%, sys=6.37%, ctx=46440, majf=0, minf=9341
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=524288/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
seqread4k: (groupid=1, jobs=1): err= 0: pid=9342: Tue May 16 11:22:13 2017
  read : io=2048.0MB, bw=52592KB/s, iops=13147, runt= 39876msec
    slat (usec): min=2, max=625, avg= 7.01, stdev= 4.11
    clat (usec): min=333, max=625525, avg=4859.05, stdev=10418.57
     lat (usec): min=709, max=625530, avg=4866.41, stdev=10418.52
    clat percentiles (usec):
     |  1.00th=[ 1416],  5.00th=[ 1928], 10.00th=[ 2224], 20.00th=[ 2576],
     | 30.00th=[ 2768], 40.00th=[ 2960], 50.00th=[ 3184], 60.00th=[ 3504],
     | 70.00th=[ 3856], 80.00th=[ 4384], 90.00th=[ 5472], 95.00th=[17280],
     | 99.00th=[30848], 99.50th=[45312], 99.90th=[121344], 99.95th=[150528],
     | 99.99th=[618496]
    bw (KB  /s): min=19323, max=76312, per=100.00%, avg=53059.69, stdev=11007.80
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.05%
    lat (msec) : 2=5.92%, 4=67.51%, 10=19.52%, 20=4.68%, 50=1.88%
    lat (msec) : 100=0.30%, 250=0.12%, 500=0.01%, 750=0.01%
  cpu          : usr=3.20%, sys=12.37%, ctx=66834, majf=0, minf=12262
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=524288/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randwrite4k: (groupid=2, jobs=1): err= 0: pid=9343: Tue May 16 11:22:13 2017
  write: io=2048.0MB, bw=6143.9KB/s, iops=1535, runt=341384msec
    slat (usec): min=3, max=74827, avg=14.54, stdev=265.59
    clat (usec): min=4, max=1451.4K, avg=41654.95, stdev=76677.14
     lat (usec): min=661, max=1451.4K, avg=41669.91, stdev=76677.24
    clat percentiles (usec):
     |  1.00th=[  732],  5.00th=[  788], 10.00th=[  844], 20.00th=[ 1012],
     | 30.00th=[ 1448], 40.00th=[ 2672], 50.00th=[ 8768], 60.00th=[18048],
     | 70.00th=[32640], 80.00th=[63232], 90.00th=[128512], 95.00th=[195584],
     | 99.00th=[362496], 99.50th=[440320], 99.90th=[634880], 99.95th=[724992],
     | 99.99th=[937984]
    bw (KB  /s): min= 1701, max=20191, per=99.99%, avg=6142.47, stdev=1485.20
    lat (usec) : 10=0.01%, 750=1.93%, 1000=17.52%
    lat (msec) : 2=16.37%, 4=8.79%, 10=6.23%, 20=10.77%, 50=14.94%
    lat (msec) : 100=10.03%, 250=10.52%, 500=2.60%, 750=0.27%, 1000=0.04%
    lat (msec) : 2000=0.01%
  cpu          : usr=0.93%, sys=3.01%, ctx=291049, majf=0, minf=9160
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=524288/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randread4k: (groupid=3, jobs=1): err= 0: pid=9348: Tue May 16 11:22:13 2017
  read : io=2048.0MB, bw=18305KB/s, iops=4576, runt=114570msec
    slat (usec): min=2, max=675, avg= 6.47, stdev= 4.36
    clat (usec): min=398, max=420314, avg=13977.09, stdev=18156.77
     lat (usec): min=408, max=420319, avg=13983.90, stdev=18156.45
    clat percentiles (usec):
     |  1.00th=[  932],  5.00th=[ 1288], 10.00th=[ 1880], 20.00th=[ 3504],
     | 30.00th=[ 5088], 40.00th=[ 6496], 50.00th=[ 7968], 60.00th=[10560],
     | 70.00th=[15424], 80.00th=[19840], 90.00th=[30592], 95.00th=[43776],
     | 99.00th=[89600], 99.50th=[118272], 99.90th=[183296], 99.95th=[211968],
     | 99.99th=[288768]
    bw (KB  /s): min= 8480, max=33488, per=99.85%, avg=18276.89, stdev=3543.03
    lat (usec) : 500=0.01%, 750=0.21%, 1000=1.41%
    lat (msec) : 2=9.23%, 4=12.03%, 10=35.44%, 20=21.82%, 50=16.23%
    lat (msec) : 100=2.85%, 250=0.75%, 500=0.02%
  cpu          : usr=1.51%, sys=4.34%, ctx=82382, majf=0, minf=9179
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=524288/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randrw4k: (groupid=4, jobs=1): err= 0: pid=9351: Tue May 16 11:22:13 2017
  read : io=2048.0MB, bw=18213KB/s, iops=4553, runt=115147msec
    slat (usec): min=2, max=552, avg= 6.65, stdev= 4.47
    clat (usec): min=451, max=447998, avg=14047.29, stdev=18663.83
     lat (usec): min=463, max=448012, avg=14054.28, stdev=18663.52
    clat percentiles (usec):
     |  1.00th=[  924],  5.00th=[ 1240], 10.00th=[ 1752], 20.00th=[ 3376],
     | 30.00th=[ 5088], 40.00th=[ 6560], 50.00th=[ 8032], 60.00th=[10816],
     | 70.00th=[15424], 80.00th=[20096], 90.00th=[30592], 95.00th=[43264],
     | 99.00th=[89600], 99.50th=[127488], 99.90th=[193536], 99.95th=[224256],
     | 99.99th=[296960]
    bw (KB  /s): min= 5688, max=33640, per=99.58%, avg=18135.13, stdev=3464.69
    lat (usec) : 500=0.01%, 750=0.21%, 1000=1.58%
    lat (msec) : 2=9.99%, 4=11.73%, 10=34.39%, 20=21.98%, 50=16.48%
    lat (msec) : 100=2.85%, 250=0.75%, 500=0.03%
  cpu          : usr=1.56%, sys=4.51%, ctx=81468, majf=0, minf=9156
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=524288/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: io=2048.0MB, aggrb=25754KB/s, minb=25754KB/s, maxb=25754KB/s, mint=81429msec, maxt=81429msec

Run status group 1 (all jobs):
   READ: io=2048.0MB, aggrb=52591KB/s, minb=52591KB/s, maxb=52591KB/s, mint=39876msec, maxt=39876msec

Run status group 2 (all jobs):
  WRITE: io=2048.0MB, aggrb=6143KB/s, minb=6143KB/s, maxb=6143KB/s, mint=341384msec, maxt=341384msec

Run status group 3 (all jobs):
   READ: io=2048.0MB, aggrb=18304KB/s, minb=18304KB/s, maxb=18304KB/s, mint=114570msec, maxt=114570msec

Run status group 4 (all jobs):
   READ: io=2048.0MB, aggrb=18212KB/s, minb=18212KB/s, maxb=18212KB/s, mint=115147msec, maxt=115147msec

Disk stats (read/write):
  sdb: ios=1572077/1047305, merge=787/1557, ticks=17142028/27098880, in_queue=44240148, util=99.51%